artillery/homework_5.yml
config:
  target: "https://open.kickbox.com/"
  phases:
    - duration: 300
      arrivalRate: 2
      name: Spike-pre Warm-Up
    - duration: 10
      arrivalRate: 20
      name: Spike test
    - duration: 300
      arrivalRate: 2
      name: Spike-post Cool-down
  payload:
    -
      path: "keywords.csv"
      fields:
        - "fruit"
        - "vegetable"
      order: sequence
      skipHeader: false
      cast: false
      skipEmptyLines: true

  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 10
      - http.response_time.max: 2000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 600"

scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ **fruit** }}"
      - post:
          url: "{{ target }}post?param2={{ **vegetable** }}"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
          - json: "$.json"
            as: "request_body"
          - json: "$.headers.Host"
            as: "host"